Repository: Moehre2/fpcupdeluxe
Catalog: languages/fpcupdeluxe.*.po
Languages: uk, zh

source: Add context for FPC and Lazarus files.
uk: Додайте контекст для файлів FPC і Lazarus.
zh: 为FPC和Lazarus文件添加上下文

source: Re-apply local changes when updating.
uk: Повторно застосувати локальні зміни при оновленні.
zh: 当更新时,重新应用本地更改

source: Always ask for confirmation.
uk: Завжди питати підтвердження.
zh: 始终要求确认

source: Docked Lazarus IDE.
uk: Пристиковане IDE Lazarus.
zh: 单窗口 (停靠式) Lazarus IDE

source: Allow patching of sources by online patches.
uk: Дозволяти патчі джерел на онлайн-патчері.
zh: 允许通过在线修补程序修补源文件

source: Be extra verbose.
uk: Виводити докладнішу інформацію.
zh: 更加冗长的输出

source: Use local repo-client.
uk: Використовувати локальний клієнт репозиторію.
zh: 使用本地仓库客户端

source: Build FPC unicode.
uk: Зібрати юнікодний FPC.

source: Only use fpcup bootstrappers.
uk: Використовувати лише fpcup bootstrapper.
zh: 仅使用fpcup bootstrappers

source: Check for fpcupdeluxe updates.
uk: Перевірити оновлення fcupdeluxe.
zh: 检查fpcupdeluxe的更新

source: Include Help.
uk: Включити довідку.
zh: 包含帮助

source: Include LCL with cross-compiler.
uk: Включити LCL із крос-компілятором.
zh: 包括交叉/跨平台编译器使用的LCL

source: Get package repositories.
uk: Отримати репозиторії пакунків.
zh: 获取软件包仓库

source: Get FPC/Laz repositories.
uk: Отримати репозиторії FPC/Laz.
zh: 获取FPC/Laz存储库

source: Save settings in fpcup-script.
uk: Зберегти налаштування в fpcup-script.

source: Send location and install info.
uk: Надіслати інформацію про місцезнаходження та встановлення.
zh: 发送位置和安装信息

source: Split FPC source and bins.
uk: Розділити джерело та бінарний FPC.
zh: 分离FPC源文件和二进制文件

source: Split Lazarus source and bins.
uk: Розділити джерело та бінарний Lazarus.
zh: 分离Lazarus源文件和二进制文件

source: Use system FPC for Lazarus.
uk: Використовувати системний FPC для Lazarus.
zh: 让Lazarus使用系统上的FPC

source: FPC/Laz rebuild only.
uk: Тільки перебудувати FPC/Laz.
zh: 仅重新构建FPC/Lazarus

source: Use jobs for GNU make.
uk: Використовувати завдання для GNU make.
zh: 为GNU make使用jobs

source: Use wget/libcurl as downloader.
uk: Використайте wget/libcurl як завантажувач.
zh: 使用wget/libcurl作为下载器

# extrasettings.captionusesoftfloat80bit
source: Enable software emulation of 80 bit floats.
uk: Увімкнути програмну емуляцію 80 бітових з плаваючою крапкою.
zh: 启用80位浮点的软件仿真

source: Double clicking on FPC and Lazarus files will open Lazarus.
uk: Подвійне натискання на FPC і Lazarus відкриє Lazarus.
zh: 在FPC和Lazarus文件上双击将打开Lazarus

source: Fpcupdeluxe can re-apply the local changes automagically by using local auto-patch.
uk: Fpcupdeluxe може повторно застосувати локальні зміни автоматично, за допомогою локальних автопатчів.
zh: Fpcupdeluxe可以通过使用本地自动补丁来自动地重新应用本地更改

source: Show a confirmation dialog with yes/no before every build.
uk: Показати діалог підтвердження з "так" або "ні" перед кожною побудовою.
zh: 在每次构建前,显示一个带有 是/否 的确认对话框

source: Build a docked Lazarus IDE
uk: Зібрати пристиковане IDE Lazarus
zh: 构建一个单窗口 (停靠式) 的Lazarus IDE

source: Fpcupdeluxe can patch the sources automagically by using online patches.
uk: Fpcupdeluxe може виправляти джерела автоматично, за допомогою онлайн патчів.
zh: Fpcupluxex可以使用在线修补程序来自动修补源文件

source: Use the repo-client by fpcupdeluxe.
uk: Використовувати repo-клієнт від fpcupdeluxe.
zh: 使用fpcupdeluxe的repo-client

source: Build FPC unicode for better Delphi compatibility.
uk: Зібрати юнікодний FPC для кращої сумісності з Delphi.

source: Check for updates of fpcupdeluxe binaries.
uk: Перевірка оновлень виконуваних файлів fpcupdelux.
zh: 检查fpcupdeluxe二进制文件的的更新

source: Download whole repository, or only latest files.
uk: Завантажити весь репозиторій або тільки останні файли.
zh: 下载整个仓库,或者只下载最新的文件

source: Save the current install-settings in a fpclazup-script for later use.
uk: Зберегти поточні параметри встановлення в Fpclazup-скрипті для подальшого використання.

source: Location and install info will be send to public central fpcupdeluxe server.
uk: Інформація про місцеперебування та встановлення буде передано до публічного центрального fpcupdeluxe сервера.
zh: 位置和安装信息将发送到公共的中心fpcupdeluxe服务器

source: Use the system wide install of FPC to build Lazarus.
uk: Використовуйте системну установку FPC для збирання Lazarus.
zh: 使用全系统范围内安装的FPC来构建Lazarus

# extrasettings.hintusesoftfloat80bit
source: Enable software emulation of 80 bit floats.
uk: Увімкнути програмну емуляцію 80 бітових з плаваючою крапкою.
zh: 启用80位浮点的软件仿真.

source: FPCUPdeluxe can try to download them if available !
uk: FPCUPdeluxe може спробувати їх завантажити, за наявності !
zh: 如果可以的话，FPCUPdeluxe会尝试下载它们！

source: Going to auto-build all installed cross-compilers !
uk: Йде автоматична збірка усіх встановлених крос-компіляторів!
zh: 将自动构建所有已安装的交叉编译器!

source: Checking FPC configfile [fpc.cfg] for cross-compilers in
uk: Перевірка файлу налаштувань FPC [fpc.cfg] для крос-компіляторів
zh: 检查FPC配置文件[fpc.cfg]对于交叉编译器 在

source: Found crosscompiler for
uk: Знайдено крос-компілятор для
zh: 找到交叉编译器用于

source: Going to update cross-compiler.
uk: Йде оновлення крос-компілятора.
zh: 将更新交叉编译器。

source: Going to install a cross-compiler from available sources.
uk: Йде встановлення крос-компілятора з доступних джерел.
zh: 将从可获得的源文件去安装一个交叉编译器。

source: Please wait. Checking for updates.
uk: Зачекайте, будь ласка. Перевірка оновлень.
zh: 请稍候，正在检查更新。

source: FPCUPdeluxe cannot be run inside the Downloads folder.
uk: FPCUPdeluxe не може бути запущений у теці Завантаження.
zh: FPCUPdeluxe不能在其下载的文件夹中运行.

source: This is NOT allowed by OSX security measures.
uk: Це не дозволено заходами безпеки OSX.
zh: 在OSX的安全措施下，这是不允许的。

source: Copy FPCUPdeluxe into its own directory and run from there.
uk: Скопіюйте FPCUPdeluxe до власної теки та запустіть звідти.
zh: 将FPCUPdeluxe复制到它自己的目录中,并从中运行。

source: FPCUPdeluxe could not create its necessary setting-files.
uk: FPCUPdeluxe не вдалося створити свої необхідні файли налаштувань.
zh: FPCUPdeluxe无法创建其必需的设置文件。

source: Please check the folder permissions, and re-start.
uk: Будь ласка, перевірте права доступу до теки й перезапустіть знову.
zh: 请检查文件夹权限,并重新启动。

source: Going to install %s and %s%s.
uk: Йде встановлення %s та %s%s.

source: Going to install the %s.
uk: Йде встановлення %s.

source: Going to install the cross-compiler for
uk: Встановлюємо крос-компілятор для
zh: 转到安装交叉/跨平台编译器,针对

source: Install directory
uk: Тека встановлення
zh: 安装目录

source: Current install directory
uk: Поточна тека встановлення
zh: 当前安装目录

source: Going to install/update FPC.
uk: Йде встановлення/оновлення FPC.
zh: 将安装/更新FPC。

source: Going to install/update FPC and Lazarus.
uk: Йде встановлення/оновлення FPC і Lazarus.
zh: 将安装/更新FPC和Lazarus。

source: Going to install/update Lazarus.
uk: Йде встановлення/оновлення Lazarus.
zh: 将安装/更新Lazarus。

source: Going to install/update module
uk: Йде встановлення/оновлення модуля
zh: 将安装/更新模块

source: Got settings from install directory
uk: Отримано параметри з теки встановлення
zh: 从安装目录中取得了设置

source: Looking for
uk: Шукаю
zh: 查找

source: Going to look for the right cross-bins. Can (will) take some time !
uk: Шукаю правильний крос-бінарники. Може (буде) займати деякий час!
zh: 将要查找正确的交叉二进制文件，这可能会花费一段时间！

source: Going to look for the right cross-libraries. Can (will) take some time !
uk: Шукаємо правильні крос-бібліотеки. Може (буде) зайняти деякий час!
zh: 将要查找正确的交叉库，这可能会花费一段时间！

source: Looking for FPCUPdeluxe cross-tools on GitHub (if any).
uk: Пошук FPCUPdeluxe крос-інструменти на GitHub (якщо такі є).
zh: 正在Github上查找FPCUPdeluxe交叉工具 (如果存在)

source: The building of a crosscompiler failed due to missing cross-tools.
uk: Не вдалося побудувати кроскомпілятор через відсутність крос-інструментів.
zh: 由于缺少交叉/跨平台的工具,交叉/跨平台编译器的构建失败.

source: Do you want to continue ?
uk: Бажаєте продовжити?
zh: 你想继续吗?

source: Please quit FPCUPdeluxe.
uk: Будь ласка, вийдіть з FPCUPdeluxe.
zh: 请退出fpcupdeluxe。

source: Going to remove the cross-compiler for
uk: Збираємось видалити крос-компілятор для
zh: 转到移除交叉/跨平台编译器,针对

source: Going to remove module
uk: Йде видалення модуля
zh: 转到移除模块

source: Please select a CPU target first.
uk: Спершу виберіть цільовий ЦП.

source: Please select a FPC and Lazarus target first
uk: Спершу виберіть цільовий FPC і Lazarus
zh: 请先选择一个FPC目标和一个Lazarus目标

source: Please select a FPC target first
uk: Спершу виберіть цільовий FPC
zh: 请先选择一个FPC目标

source: Please select a Lazarus target first
uk: Спершу виберіть цільовий Lazarus
zh: 请先选择一个Lazarus目标

source: Please select an OS target first.
uk: Спершу виберіть цільову ОС.

source: Having a space in your install path is very ill-advised !
uk: Мати пробіл в шляху встановлення є дуже необачним!
zh: 在你的安装路径中包含空格是十分不明智的！

source: Trying to build the cross-compiler for
uk: Спроба побудувати крос-компілятор для
zh: 尝试构建交叉/跨平台编译器,针对

source: Going to update all crosscompilers
uk: Оновлення всіх крос-компіляторів
zh: 转到更新所有的交叉/跨平台编译器

source: New FPCUPdeluxe version available
uk: Доступна нова версія FPCUPdeluxe
zh: 可新的fpcupdeluxe版本

source: No updates found.
uk: Оновлення не знайдено.
zh: 未找到更新.

source: E&xit
uk: Вийти &X
zh: 退出(&x)

source: Exit
uk: Вихід
zh: 退出

source: &Save log
uk: Зберегти лог
zh: 保存日志(&S)

source: Save As
uk: Зберегти як
zh: 另存为

source: Will install/update FPC and Lazarus stable and LAMW
uk: Встановить/оновить Стабільні FPC і Lazarus і LAMW
zh: 将安装/更新FPC和Lazarus稳定版本和LAMW

source: Basic
uk: Основне
zh: 基本

source: Install/update FPC+Lazarus
uk: Встановити/оновити FPC+Lazarus
zh: 将安装/更新FPC和Lazarus

source: Will install/update the selected version of both FPC and Lazarus.
uk: Встановить / оновить обрану версію FPC і Lazarus.
zh: 将安装/更新选定的FPC和Lazarus版本。

source: Only FPC
uk: Тільки FPC
zh: 仅安装FPC

source: Only install/update selected FPC version.
uk: Тільки встановлення/оновлення обраної версії FPC.
zh: 仅安装/更新选择的FPC版本.

# tform1.bitbtnfpconlytag.caption
source: Add Tag
uk: Добавити теґ
zh: 添加标记

source: Add tag/url into FPC install list
uk: Додати теґ/url до списку встановлення FPC
zh: 添加标记/url到FPC安装列表

source: Set FPC hash in Setup+
uk: Встановити хеш FPC в Налаштування +
zh: 在设置+中设置FPC的hash

source: Set FPC revision
uk: Встановити ревізію FPC
zh: 设置FPC修订版本

source: STOP
uk: ЗУПИНИТИ
zh: 停止

source: Try to stop current install process
uk: Спроба зупинити поточне встановлення
zh: 尝试停止当前安装过程

source: Only Lazarus
uk: Лише Lazarus
zh: 仅安装Lazarus

source: Only install/update selected Lazarus version.
uk: Тільки встановити/оновити вибрану версію Lazarus.
zh: 仅安装/更新选择的Lazarus版本.

# tform1.bitbtnlazarusonlytag.caption
source: Add Tag
uk: Додати теґ
zh: 添加标记

source: Add tag/url into Lazarus install list
uk: Додати теґ/url до списку встановлення Lazarus
zh: 添加标记/url到Lazarus安装列表

source: Set Lazarus hash in Setup+
uk: Встановити хеш Lazarus в Налаштування +
zh: 在设置+中设置Lazarus的hash

source: Set Lazarus revision
uk: Встановити ревізію Lazarus
zh: 设置Lazarus修订版本

source: Build Native Compiler
uk: Зібрати нативний компілятор

source: Check Tools Location
uk: Перевірте розташування інструментів
zh: 检查工具位置

source: Clear log
uk: Очистити логи
zh: 清除日志

source: Create Lazarus Configuration
uk: Створення конфігурації Lazarus
zh: 创建Lazarus配置文件

source: Get OpenSSL by Browser
uk: Отримати OpenSSL через браузер
zh: 通过浏览器获取OpenSSL

source: Set install path
uk: Вибрати шлях встановлення
zh: 设置安装路径

source: Install module
uk: Встановити модуль
zh: 安装模块

source: Install the selected module.
uk: Встановити вибраний модуль.
zh: 安装选择的模块.

source: Email log
uk: Відправити журнал
zh: 电邮日志

source: Send email to fpcup maintainer containing Commandscreen output.
uk: Надіслати електронного листа до супроводу fpcup, що містить вивід екрану команд.
zh: 将命令窗口中的输出发送给fpcup维护人员。

source: Setup+
uk: Встановлення+
zh: 设置+

source: Open the extended settings form.
uk: Відкрити форму розширених налаштувань.
zh: 打开扩展的设置窗体。

source: Uninstall module
uk: Видалити модуль
zh: 卸载模块

source: Uninstall the selected module.
uk: Видалити вибраний модуль.
zh: 卸载选择的模块。

source: Update Lazarus Makefiles
uk: Оновлення файлів Make Lazarus
zh: 更新Lazarus的Makefiles

source: Update all
uk: Оновити все
zh: 更新所有

source: Auto-update all installed cross-compilers.
uk: Автоматичне оновлення усіх встановлених крос-компіляторів.
zh: 自动升级所有已安装的交叉编译器。

source: Install compiler
uk: Встановити компілятор
zh: 安装编译器

source: Install the selected CPU-OS cross-compiler.
uk: Встановити вибраний CPU-OS крос-компілятор.
zh: 安装选择的CPU和操作系统的交叉编译器。

source: Remove compiler
uk: Видалити компілятор
zh: 移除编译器

source: Remove the selected CPU-OS cross-compiler.
uk: Вилучити вибраний CPU-OS крос-компілятор.
zh: 移除已选择的目标CPU和操作系统的交叉编译器。

source: Set subarch
uk: Встановіть субарх
zh: 设置subarch

source: Select a subarch for embedded target.
uk: Виберіть субарх для вбудованої цілі.
zh: 为嵌入式目标选择一个subarch

source: Auto clear
uk: Автоочищення
zh: 自动清理

source: Check Makefile FPC
uk: Перевірити FPC Makefile
zh: 检查Makefile FPC

source: Check Makefile Lazarus
uk: Перевірити Makefile Lazarus
zh: 检查Makefile Lazarus

source: Re-create startup scripts
uk: Перестворити скрипти запуску
zh: 重新创建启动脚本

source: Cross
uk: Крос
zh: 跨平台/交叉编译

source: Get FPC for ESP32 [lx6] boards
uk: Отримайте FPC для ESP32 [lx6] плат
zh: 为ESP32 [lx6]开发板安装FPC

source: Extras
uk: Додатково
zh: 附加

source: Fixes
uk: Виправлення
zh: 修正版本

source: Will install/update current fixes versions of both FPC and Lazarus
uk: Встановить / оновить стабільну версію FPC і Lazarus
zh: 将安装/更新FPC和Lazarus的当前修正的版本

source: FPC revision history
uk: Історія ревізій FPC
zh: FPC修订版本历史

# tform1.fpctaglabel.caption
source: FPC version
uk: Версія FPC
zh: FPC版本

# tform1.fpcversionlabel.caption
source: FPC version
uk: Версія FPC
zh: FPC版本

source: History
uk: Історія
zh: 历史

source: Directory to install FPC and Lazarus
uk: Каталог для встановлення FPC і Lazarus
zh: 安装FPC和Lazarus的目录

source: Lazarus revision history
uk: Історія ревізій Lazarus
zh: Lazarus修订版本历史

# tform1.lazarustaglabel.caption
source: Lazarus version
uk: Версія Lazarus
zh: Lazarus版本

# tform1.lazarusversionlabel.caption
source: Lazarus version
uk: Версія Lazarus
zh: Lazarus版本

# tform1.listboxfpchistorynew.columns[0].caption
source: Hash
uk: Хеш

# tform1.listboxfpchistorynew.columns[1].caption
source: Rev-name
uk: Назва ревізії

# tform1.listboxfpchistorynew.columns[2].caption
source: Date
uk: Дата

# tform1.listboxlazarushistorynew.columns[0].caption
source: Hash
uk: Хеш

# tform1.listboxlazarushistorynew.columns[1].caption
source: Rev-name
uk: Назва ревізії

# tform1.listboxlazarushistorynew.columns[2].caption
source: Date
uk: Дата

source: About Up
uk: Про додаток

source: Chinese (CN)
uk: Китайська (CN)
zh: 简体中文 (CN)

source: Dutch (NL)
uk: Німецька (NL)
zh: 荷兰语 (NL)

source: Will show info and error
uk: Буде показано інформацію і помилку
zh: 将显示信息和错误

source: English (EN)
uk: Англійська (EN)
zh: 英语 (EN)

source: &File
uk: &Файл
zh: 文件 (&F)

source: Languages
uk: Мови
zh: 语言

source: Issues
uk: Проблеми

source: FPC bugs
uk: Помилки FPC

source: French (F)
uk: Французька (F)
zh: 法语 (F)

source: German (D)
uk: Німецька (D)
zh: 德语 (D)

source: Help
uk: Допомога

source: Up Lazarus forum
uk: До форуму Lazarus
zh: 前往Lazarus论坛

source: Up GitHub issues
uk: До проблем на GitHub
zh: 前往GitHub issues

source: Korean (KR)
uk: Корейська (KR)
zh: 韩语 (KR)

source: Lazarus bugs
uk: Баги Lazarus

source: Modules
uk: Модулі
zh: 模块

source: Online docs
uk: Онлайн документація

source: Get the mORMot for FPC
uk: Отримати MORMot для FPC
zh: 为FPC安装mORMot

source: Ukrainian (UK)
uk: Українська (UK)
zh: 乌克兰 (UK)

source: Online Wiki
uk: Онлайн Вікі

source: Will install/update the Online Package Manager
uk: Буде встановлено/оновлено Онлайн Менеджер Пакунків
zh: 将安装/更新在线包管理器

source: Pico
uk: Піко

source: Get FPC for armv6m RPi Pico
uk: Отримайте FPC для armv6m RPi Pico
zh: 为armv6m RPi Pico安装FPC

source: CPU
uk: ЦП

source: OS
uk: ОС
zh: 操作系统

# tform1.realfpcurl.hint
source: Double click to allow editing
uk: Подвійний клік, щоб дозволити редагування
zh: 双击以允许编辑

# tform1.reallazurl.hint
source: Double click to allow editing
uk: Подвійний клік, щоб дозволити редагування
zh: 双击以允许编辑

source: Stable
uk: Стабільний
zh: 稳定版本

source: Will install/update stable versions of both FPC and Lazarus
uk: Встановить / оновить стабільну версію FPC і Lazarus
zh: 将安装/更新FPC和Lazarus的稳定的版本

source: Sitting and waiting
uk: Сидіть та чекайте
zh: 等待中

source: Tags
uk: Теги
zh: 标记

source: Trunk
uk: Транк
zh: Trunk(主干)版本

source: Will install/update trunk version of both FPC and Lazarus.
uk: Встановить / оновить транкову версію FPC і Lazarus.
zh: 将安装/更新FPC和Lazarus的主干的(trunk)版本.

source: Install baremetal Ultibo for RPi3
uk: Встановити бареметал Ультібо для RPi3
zh: 为RPi3安装baremetal Ultibo

source: Install FPC and Lazarus for Web Assembly
uk: Встановити FPC і Lazarus для веб-асемблера
zh: 为Web Assembly安装FPC和Lazarus

source: Get FPC for SAMD51 embedded on Wio Terminal
uk: Отримайте FPC для SAMD51 вбудованого в Wio терміналі
zh: 为嵌入在Wio终端上的SAMD51安装FPC

source: Add FPC patch
uk: Додати патч FPC
zh: 添加FPC补丁

source: Add Laz. patch
uk: Додати патч Lazarus
zh: 添加Lazarus补丁

source: List All
uk: Показати все
zh: 列出全部

source: Rem. FPC patch
uk: Видалити патч FPC
zh: 快速FPC修补

source: Rem. Laz. patch
uk: Видалити патч Lazarus
zh: 快速Lazarus修补

source: Tools
uk: Інструменти
zh: 工具

source: Compiler
uk: Компілятор
zh: 编译器

source: Libraries
uk: Бібліотеки
zh: 库

source: Advanced Settings
uk: Розширені налаштування

# tform2.chkfpcdebug.caption
source: Debug
uk: Відладка
zh: 调试

# tform2.chklazarusdebug.caption
source: Debug
uk: Відладка
zh: 调试

# tform2.editbinlocation.hint
source: Double click to clear
uk: Клацніть двічі для очищення
zh: 双击以清理

# tform2.editcompileroverride.hint
source: Double click to clear
uk: Клацніть двічі для очищення
zh: 双击以清理

# tform2.editliblocation.hint
source: Double click to clear
uk: Клацніть двічі для очищення
zh: 双击以清理

source: Proxy settings
uk: Налаштування Proxy
zh: 代理设置

source: Miscellaneous settings
uk: Різні налаштування
zh: 杂项设置

source: Options Override
uk: Перевизначення параметрів
zh: 选项覆盖

source: Branch and revision
uk: Гілка і ревізія
zh: 分支和修订版本

source: Pre and post install scripts
uk: Скрипти до та після встановлення
zh: 预置和后置安装脚本

source: Source patching
uk: Патчі сирців
zh: 源文件补丁

source: HTTP proxy URL:
uk: URL-адреса HTTP-проксі:
zh: HTTP代理URL:

source: HTTP proxy port:
uk: HTTP-проксі-порт:
zh: HTTP代理端口:

source: HTTP proxy username:
uk: Ім'я користувача HTTP проксі:
zh: HTTP代理用户名:

source: HTTP proxy password:
uk: Пароль проксі HTTP:
zh: HTTP代理密码:

source: Compiler Override
uk: Перевизначення компілятора
zh: 编译器覆盖

source: Select CPU
uk: Виберіть ЦП
zh: 选择CPU

source: Cross Build Options Override (i.e. -CfSoft)
uk: Перевизначення параметрів перехресної збірки (наприклад -CfSoft)
zh: 交叉构建选项覆盖(例如 -CfSoft)

source: FPC branch/tag
uk: FPC гілка/тег

source: FPC options
uk: Опції FPC
zh: FPC选项

source: FPC hash
uk: Хеш FPC

source: Laz. branch/tag
uk: Laz. гілка/тег

source: Laz. options
uk: Опції Lazarus
zh: Lazarus选项

source: Laz. hash
uk: Laz. хеш

source: Select OS
uk: Виберіть ОС
zh: 选择操作系统

source: ARM target
uk: Ціль ARM
zh: ARM目标

source: Search options
uk: Опції пошуку
zh: 搜索选项

source: Select subarch
uk: Вибрати субарх
zh: 选择subarch

source: CPU/OS
uk: ЦП/ОС
zh: CPU/操作系统

source: Subarch
uk: Субарх

source: Auto-switch repo URL.
zh: 自动切换仓库的URL

source: Aborted
zh: 中止

source: cannot execute "%s"
zh: 不能执行"%s"

source: cannot find executable "%s"
zh: 不能找到可执行文件"%s"

source: executable "%s" is a directory
zh: 可执行文件"%s"是一个目录

source: executable "%s" lacks the permission to run
zh: 可执行文件"%s"缺少权限来运行

source: Exit code %s
zh: 退出代码%s

source: freeing buffer lines: %s
zh: 释放缓冲器行: %s

source: missing directory "%s"
zh: 缺少目录"%s"

source: missing executable "%s"
zh: 缺少可执行文件"%s"

source: Success
zh: 成功

source: tool "%s" has no executable
zh: 工具"%s"没有可执行文件

source: unable to execute: %s
zh: 不能执行:%s

source: unable to read process ExitStatus
zh: 无法读取进程的ExitStatus

# tform1.listboxfpchistory.columns[0].caption
source: Hash
zh: 哈希值

# tform1.listboxfpchistory.columns[1].caption
source: Date
zh: 日期

# tform1.listboxlazarushistory.columns[0].caption
source: Hash
zh: 哈希值

# tform1.listboxlazarushistory.columns[1].caption
source: Date
zh: 日期

source: About
zh: 关于

source: OPM
zh: 在线包管理器

source: Advanced settings
zh: 高级设置

source: FPC branch
zh: FPC分支

source: FPC post
zh: FPC后置脚本

source: FPC pre
zh: FPC前置脚本

source: FPC hash/tag
zh: FPC的hash/标记

source: Laz. branch
zh: Lazarus分支

source: Lazarus post
zh: Lazarus后置脚本

source: Lazarus pre
zh: Lazarus前置脚本

source: Laz. hash/tag
zh: Lazarus的hash/标记
